summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxEray_reg.h
/**
 * \file IfxEray_reg.h
 * \brief
 * \copyright Copyright (c) 2012 Infineon Technologies AG. All rights reserved.
 *
 *
 * $Revision: 1585 $
 * $Date: 2013-09-03 13:30:24 +0200 (Di, 03 Sep 2013) $
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Eray_Cfg Eray address
 * \ingroup IfxLld_Eray
 * 
 * \defgroup IfxLld_Eray_Cfg_BaseAddress Base address
 * \ingroup IfxLld_Eray_Cfg
 * 
 * \defgroup IfxLld_Eray_Cfg_Eray0 2-ERAY0
 * \ingroup IfxLld_Eray_Cfg
 * 
 */
#ifndef IFXERAY_REG_H
#define IFXERAY_REG_H
/******************************************************************************/
#include "IfxEray_regdef.h"
/******************************************************************************/
/** \addtogroup IfxLld_Eray_Cfg_BaseAddress
 * \{  */

/** \\brief  ERAY object */
#define MODULE_ERAY0 /*lint --e(923)*/ ((*(Ifx_ERAY*)0xF001C000u))
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Eray_Cfg_Eray0
 * \{  */

/** \\brief  8FC, Access Enable Register 0 */
#define ERAY0_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_ERAY_ACCEN0*)0xF001C8FCu)

/** Alias (User Manual Name) for ERAY0_ACCEN0.
* To use register names with standard convension, please use ERAY0_ACCEN0.
*/
#define	ERAY_ACCEN0	(ERAY0_ACCEN0)

/** \\brief  8F8, Access Enable Register 1 */
#define ERAY0_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_ERAY_ACCEN1*)0xF001C8F8u)

/** Alias (User Manual Name) for ERAY0_ACCEN1.
* To use register names with standard convension, please use ERAY0_ACCEN1.
*/
#define	ERAY_ACCEN1	(ERAY0_ACCEN1)

/** \\brief  128, Aggregated Channel Status */
#define ERAY0_ACS /*lint --e(923)*/ (*(volatile Ifx_ERAY_ACS*)0xF001C128u)

/** Alias (User Manual Name) for ERAY0_ACS.
* To use register names with standard convension, please use ERAY0_ACS.
*/
#define	ERAY_ACS	(ERAY0_ACS)

/** \\brief  104, Communication Controller Error Vector */
#define ERAY0_CCEV /*lint --e(923)*/ (*(volatile Ifx_ERAY_CCEV*)0xF001C104u)

/** Alias (User Manual Name) for ERAY0_CCEV.
* To use register names with standard convension, please use ERAY0_CCEV.
*/
#define	ERAY_CCEV	(ERAY0_CCEV)

/** \\brief  100, Communication Controller Status Vector */
#define ERAY0_CCSV /*lint --e(923)*/ (*(volatile Ifx_ERAY_CCSV*)0xF001C100u)

/** Alias (User Manual Name) for ERAY0_CCSV.
* To use register names with standard convension, please use ERAY0_CCSV.
*/
#define	ERAY_CCSV	(ERAY0_CCSV)

/** \\brief  0, Clock Control Register */
#define ERAY0_CLC /*lint --e(923)*/ (*(volatile Ifx_ERAY_CLC*)0xF001C000u)

/** Alias (User Manual Name) for ERAY0_CLC.
* To use register names with standard convension, please use ERAY0_CLC.
*/
#define	ERAY_CLC	(ERAY0_CLC)

/** \\brief  3F0, Core Release Register */
#define ERAY0_CREL /*lint --e(923)*/ (*(volatile Ifx_ERAY_CREL*)0xF001C3F0u)

/** Alias (User Manual Name) for ERAY0_CREL.
* To use register names with standard convension, please use ERAY0_CREL.
*/
#define	ERAY_CREL	(ERAY0_CREL)

/** \\brief  4, Busy and Input Buffer Control Register */
#define ERAY0_CUST1 /*lint --e(923)*/ (*(volatile Ifx_ERAY_CUST1*)0xF001C004u)

/** Alias (User Manual Name) for ERAY0_CUST1.
* To use register names with standard convension, please use ERAY0_CUST1.
*/
#define	ERAY_CUST1	(ERAY0_CUST1)

/** \\brief  C, Customer Interface Timeout Counter */
#define ERAY0_CUST3 /*lint --e(923)*/ (*(volatile Ifx_ERAY_CUST3*)0xF001C00Cu)

/** Alias (User Manual Name) for ERAY0_CUST3.
* To use register names with standard convension, please use ERAY0_CUST3.
*/
#define	ERAY_CUST3	(ERAY0_CUST3)

/** \\brief  34, Error Service Request Enable Reset */
#define ERAY0_EIER /*lint --e(923)*/ (*(volatile Ifx_ERAY_EIER*)0xF001C034u)

/** Alias (User Manual Name) for ERAY0_EIER.
* To use register names with standard convension, please use ERAY0_EIER.
*/
#define	ERAY_EIER	(ERAY0_EIER)

/** \\brief  30, Error Service Request Enable Set */
#define ERAY0_EIES /*lint --e(923)*/ (*(volatile Ifx_ERAY_EIES*)0xF001C030u)

/** Alias (User Manual Name) for ERAY0_EIES.
* To use register names with standard convension, please use ERAY0_EIES.
*/
#define	ERAY_EIES	(ERAY0_EIES)

/** \\brief  28, Error Service Request Line Select */
#define ERAY0_EILS /*lint --e(923)*/ (*(volatile Ifx_ERAY_EILS*)0xF001C028u)

/** Alias (User Manual Name) for ERAY0_EILS.
* To use register names with standard convension, please use ERAY0_EILS.
*/
#define	ERAY_EILS	(ERAY0_EILS)

/** \\brief  20, Error Service Request Register */
#define ERAY0_EIR /*lint --e(923)*/ (*(volatile Ifx_ERAY_EIR*)0xF001C020u)

/** Alias (User Manual Name) for ERAY0_EIR.
* To use register names with standard convension, please use ERAY0_EIR.
*/
#define	ERAY_EIR	(ERAY0_EIR)

/** \\brief  3F4, Endian Register */
#define ERAY0_ENDN /*lint --e(923)*/ (*(volatile Ifx_ERAY_ENDN*)0xF001C3F4u)

/** Alias (User Manual Name) for ERAY0_ENDN.
* To use register names with standard convension, please use ERAY0_ENDN.
*/
#define	ERAY_ENDN	(ERAY0_ENDN)

/** \\brief  130, Even Sync ID Symbol Window \note Array index shifted by 1.
 * Example: defined register ESID_1S[0]/ESID_1S0 corresponds to user manual
 * ESID_1S1, ... */
#define ERAY0_ESID_1S0 /*lint --e(923)*/ (*(volatile Ifx_ERAY_ESID*)0xF001C130u)

/** Alias (User Manual Name) for ERAY0_ESID_1S0.
* To use register names with standard convension, please use ERAY0_ESID_1S0.
*/
#define	ERAY_ESID01	(ERAY0_ESID_1S0)

/** \\brief  134, Even Sync ID Symbol Window \note Array index shifted by 1.
 * Example: defined register ESID_1S[0]/ESID_1S0 corresponds to user manual
 * ESID_1S1, ... */
#define ERAY0_ESID_1S1 /*lint --e(923)*/ (*(volatile Ifx_ERAY_ESID*)0xF001C134u)

/** Alias (User Manual Name) for ERAY0_ESID_1S1.
* To use register names with standard convension, please use ERAY0_ESID_1S1.
*/
#define	ERAY_ESID02	(ERAY0_ESID_1S1)

