summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxEray_reg.h
/** Alias (User Manual Name) for ERAY0_RDDS_1S62.
* To use register names with standard convension, please use ERAY0_RDDS_1S62.
*/
#define	ERAY_RDDS63	(ERAY0_RDDS_1S62)

/** \\brief  6FC, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY0_RDDS_1S63 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C6FCu)

/** Alias (User Manual Name) for ERAY0_RDDS_1S63.
* To use register names with standard convension, please use ERAY0_RDDS_1S63.
*/
#define	ERAY_RDDS64	(ERAY0_RDDS_1S63)

/** \\brief  61C, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY0_RDDS_1S7 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C61Cu)

/** Alias (User Manual Name) for ERAY0_RDDS_1S7.
* To use register names with standard convension, please use ERAY0_RDDS_1S7.
*/
#define	ERAY_RDDS08	(ERAY0_RDDS_1S7)

/** \\brief  620, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY0_RDDS_1S8 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C620u)

/** Alias (User Manual Name) for ERAY0_RDDS_1S8.
* To use register names with standard convension, please use ERAY0_RDDS_1S8.
*/
#define	ERAY_RDDS09	(ERAY0_RDDS_1S8)

/** \\brief  624, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY0_RDDS_1S9 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C624u)

/** Alias (User Manual Name) for ERAY0_RDDS_1S9.
* To use register names with standard convension, please use ERAY0_RDDS_1S9.
*/
#define	ERAY_RDDS10	(ERAY0_RDDS_1S9)

/** \\brief  700, Read Header Section 1 */
#define ERAY0_RDHS1 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDHS1*)0xF001C700u)

/** Alias (User Manual Name) for ERAY0_RDHS1.
* To use register names with standard convension, please use ERAY0_RDHS1.
*/
#define	ERAY_RDHS1	(ERAY0_RDHS1)

/** \\brief  704, Read Header Section 2 */
#define ERAY0_RDHS2 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDHS2*)0xF001C704u)

/** Alias (User Manual Name) for ERAY0_RDHS2.
* To use register names with standard convension, please use ERAY0_RDHS2.
*/
#define	ERAY_RDHS2	(ERAY0_RDHS2)

/** \\brief  708, Read Header Section 3 */
#define ERAY0_RDHS3 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDHS3*)0xF001C708u)

/** Alias (User Manual Name) for ERAY0_RDHS3.
* To use register names with standard convension, please use ERAY0_RDHS3.
*/
#define	ERAY_RDHS3	(ERAY0_RDHS3)

/** \\brief  110, Slot Counter Value */
#define ERAY0_SCV /*lint --e(923)*/ (*(volatile Ifx_ERAY_SCV*)0xF001C110u)

/** Alias (User Manual Name) for ERAY0_SCV.
* To use register names with standard convension, please use ERAY0_SCV.
*/
#define	ERAY_SCV	(ERAY0_SCV)

/** \\brief  120, SYNC Frame Status */
#define ERAY0_SFS /*lint --e(923)*/ (*(volatile Ifx_ERAY_SFS*)0xF001C120u)

/** Alias (User Manual Name) for ERAY0_SFS.
* To use register names with standard convension, please use ERAY0_SFS.
*/
#define	ERAY_SFS	(ERAY0_SFS)

/** \\brief  3C, Status Service Request Enable Reset */
#define ERAY0_SIER /*lint --e(923)*/ (*(volatile Ifx_ERAY_SIER*)0xF001C03Cu)

/** Alias (User Manual Name) for ERAY0_SIER.
* To use register names with standard convension, please use ERAY0_SIER.
*/
#define	ERAY_SIER	(ERAY0_SIER)

/** \\brief  38, Status Service Request Enable Set */
#define ERAY0_SIES /*lint --e(923)*/ (*(volatile Ifx_ERAY_SIES*)0xF001C038u)

/** Alias (User Manual Name) for ERAY0_SIES.
* To use register names with standard convension, please use ERAY0_SIES.
*/
#define	ERAY_SIES	(ERAY0_SIES)

/** \\brief  2C, Status Service Request Line Select */
#define ERAY0_SILS /*lint --e(923)*/ (*(volatile Ifx_ERAY_SILS*)0xF001C02Cu)

/** Alias (User Manual Name) for ERAY0_SILS.
* To use register names with standard convension, please use ERAY0_SILS.
*/
#define	ERAY_SILS	(ERAY0_SILS)

/** \\brief  24, Status Service Request Register */
#define ERAY0_SIR /*lint --e(923)*/ (*(volatile Ifx_ERAY_SIR*)0xF001C024u)

/** Alias (User Manual Name) for ERAY0_SIR.
* To use register names with standard convension, please use ERAY0_SIR.
*/
#define	ERAY_SIR	(ERAY0_SIR)

/** \\brief  4C, Stop Watch Register 1 */
#define ERAY0_STPW1 /*lint --e(923)*/ (*(volatile Ifx_ERAY_STPW1*)0xF001C04Cu)

/** Alias (User Manual Name) for ERAY0_STPW1.
* To use register names with standard convension, please use ERAY0_STPW1.
*/
#define	ERAY_STPW1	(ERAY0_STPW1)

/** \\brief  50, Stop Watch Register 2 */
#define ERAY0_STPW2 /*lint --e(923)*/ (*(volatile Ifx_ERAY_STPW2*)0xF001C050u)

/** Alias (User Manual Name) for ERAY0_STPW2.
* To use register names with standard convension, please use ERAY0_STPW2.
*/
#define	ERAY_STPW2	(ERAY0_STPW2)

/** \\brief  80, SUC Configuration Register 1 */
#define ERAY0_SUCC1 /*lint --e(923)*/ (*(volatile Ifx_ERAY_SUCC1*)0xF001C080u)

/** Alias (User Manual Name) for ERAY0_SUCC1.
* To use register names with standard convension, please use ERAY0_SUCC1.
*/
#define	ERAY_SUCC1	(ERAY0_SUCC1)

/** \\brief  84, SUC Configuration Register 2 */
#define ERAY0_SUCC2 /*lint --e(923)*/ (*(volatile Ifx_ERAY_SUCC2*)0xF001C084u)

/** Alias (User Manual Name) for ERAY0_SUCC2.
* To use register names with standard convension, please use ERAY0_SUCC2.
*/
#define	ERAY_SUCC2	(ERAY0_SUCC2)

/** \\brief  88, SUC Configuration Register 3 */
#define ERAY0_SUCC3 /*lint --e(923)*/ (*(volatile Ifx_ERAY_SUCC3*)0xF001C088u)

/** Alias (User Manual Name) for ERAY0_SUCC3.
* To use register names with standard convension, please use ERAY0_SUCC3.
*/
#define	ERAY_SUCC3	(ERAY0_SUCC3)

/** \\brief  124, Symbol Window and Network Idle Time Status */
#define ERAY0_SWNIT /*lint --e(923)*/ (*(volatile Ifx_ERAY_SWNIT*)0xF001C124u)

/** Alias (User Manual Name) for ERAY0_SWNIT.
* To use register names with standard convension, please use ERAY0_SWNIT.
*/
#define	ERAY_SWNIT	(ERAY0_SWNIT)

